IDEA StatiCa Open Model
LineLoad.GeneralLine Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 general shape
 Namespace: IdeaRS.OpenModel.Detail.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public PolyLine2D GeneralLine { get; set; }
Public Property GeneralLine As PolyLine2D
	Get
	Set
public:
property PolyLine2D^ GeneralLine {
	PolyLine2D^ get ();
	void set (PolyLine2D^ value);
}
Property Value
Type: PolyLine2D
See Also
Reference
LineLoad Class
IdeaRS.OpenModel.Detail.Loading Namespace